БИТУправление_медицинским_центром_демо/src/Documents/Прием/Прием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Прием</name>
  <basedOn>Document.Заявка</basedOn>
  <registerRecords>InformationRegister.удалитьИсследования</registerRecords>
  <registerRecords>InformationRegister.Противопоказания</registerRecords>
  <registerRecords>InformationRegister.НаправленияПоРезультатамМедосмотра</registerRecords>
  <registerRecords>InformationRegister.СостоянияЗубов</registerRecords>
  <registerRecords>InformationRegister.Диагнозы</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <registerRecords>InformationRegister.ВыполнениеПланаЛечения</registerRecords>
  <registerRecords>InformationRegister.ВредныеФакторыПротивопоказаний</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>Осмотр</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйПрием</name>
    <type>
      <types>DefinedType.ПервичныйПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПервичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМатериалов</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировкаМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеПриема</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеШаблоновПриема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВПроведенииДопОбследования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВОбследованииВЦентреПрофпатологии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВАмбулаторномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСтационарномОбследованииИЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВСанаторноКурортномЛечении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВДиспансерномНаблюдении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВЛечебноПрофилактическомПитании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НуждаетсяВНаправленииНаМедикоСоциальнуюЭкспертизу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипЭМПЗ</name>
    <type>
      <types>CatalogRef.удалитьТипыЭМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяКарта</name>
    <type>
      <types>CatalogRef.МедицинскиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйРасчет</name>
    <type>
      <types>DocumentRef.КомплексныйРасчетКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_DICOM</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходитВСтоимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Диагнозы</name>
    <attributes>
      <name>Диагноз</name>
      <type>
        <types>CatalogRef.Диагнозы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыявленВпервые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Исход</name>
      <type>
        <types>CatalogRef.КлассификаторИсходовЗаболевания</types>
      </type>
    </attributes>
    <attributes>
      <name>Классификация1</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Классификация2</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Классификация3</name>
      <type>
        <types>EnumRef.КлассификацииДиагнозов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сопутствующий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Травма</name>
      <type>
        <types>CatalogRef.ПричиныНетрудоспособности</types>
      </type>
    </attributes>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>Профессиональное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрофнепригодностьВременная</name>
      <type>
        <types>EnumRef.ХарактерПрофнепригодности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоПротивопоказанию</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СостоянияЗубов</name>
    <attributes>
      <name>НомерЗуба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СегментЗуба</name>
      <type>
        <types>EnumRef.СегментыЗубов</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.стомСостоянияЗубов</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныПриема</name>
    <attributes>
      <name>ШаблонПриема</name>
      <type>
        <types>CatalogRef.ШаблоныHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстДляПечати</name>
      <comment>Для сохранения полученного от шаблона-ОБРАБОТКИ текста для печати между открытиями формы документа.</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеФакторыПротивопоказаний</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭМД</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_Шаблона</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭМД</name>
      <type>
        <types>CatalogRef.ШаблоныHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокументаЭМД</name>
      <type>
        <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКФайлуВАрхиве</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеРЭМД</name>
      <type>
        <types>CatalogRef.СообщенияРЭМД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиИПодписиЭМД</name>
    <attributes>
      <name>УИД_ЭМД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД_ЭЦП</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьМинздрава</name>
      <type>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СпециализацииШаблоновОсмотра/СпециализацииШаблоновОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпециализацииШаблоновОсмотра</name>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Профосмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/Прием/Forms/ПанельВыборШаблонаПриема/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветКнопки = ЦветаСтиля.ЦветФонаКнопки;
	ЦветВыделеннойКнопки = ЦветаСтиля.ФонПодписьВерна; 
	ЗаполнитьФормуКнопками();
	
	ШаблоныПриема.Загрузить(Параметры.ШаблоныПриема.Выгрузить());
	Для Каждого Шаблон Из ШаблоныПриема Цикл
		Отбор = Новый Структура("Шаблон",Шаблон.ШаблонПриема);
		Для Каждого Строка Из АссоциацииШаблонКнопка.НайтиСтроки(Отбор) Цикл
			Кнопка = Элементы.Найти(Строка.Кнопка);
			Кнопка.Пометка = Истина;
			Кнопка.ЦветФона = ЦветВыделеннойКнопки;	
			Кнопка.Родитель.Родитель.Показать();
		КонецЦикла; 
	КонецЦикла;
	
	РежимТрактовкиНажатия = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ПанельВыборШаблонаПриема", "РежимТрактовкиНажатия", 0);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если АссоциацииШаблонКнопка.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Для выбранного врача нет шаблонов, присвоенных его специализациям.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		НастройкиФормы = Новый Структура;
		НастройкиФормы.Вставить("РежимТрактовкиНажатия", РежимТрактовкиНажатия);
		
		РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ПанельВыборШаблонаПриема");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	МассивШаблонов = Новый Массив;
	Для Каждого СтрокаШаблон Из ШаблоныПриема Цикл
		МассивШаблонов.Добавить(СтрокаШаблон.ШаблонПриема);
	КонецЦикла;
	
	Закрыть();
	Состояние(НСтр("ru='Применение'"));
	Оповестить("ВыбраныШаблоныПриема", МассивШаблонов, ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыбранныеШаблоныПередНачаломИзменения(Элемент, Отказ)
	ТекущийШаблон = Элемент.ТекущиеДанные.ШаблонПриема;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеШаблоныПриИзменении(Элемент)
	ОбновитьКнопки(ТекущийШаблон);
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОбновитьКнопки(Элемент.ТекущиеДанные.ШаблонПриема);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеШаблоныПередУдалением(Элемент, Отказ)
	Отбор = Новый Структура("ШаблонПриема",Элемент.ТекущиеДанные.ШаблонПриема);
	Если ШаблоныПриема.НайтиСтроки(Отбор).Количество() = 1 Тогда
		МассивКнопок = НайтиКнопки(Элемент.ТекущиеДанные.ШаблонПриема);
		Для каждого Кнопка Из МассивКнопок Цикл
			Кнопка.Пометка = Ложь;
			Кнопка.ЦветФона = ЦветКнопки;		
		КонецЦикла; 	
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеФормыКнопками

&НаСервере
Процедура ЗаполнитьФормуКнопками()
	
	ТабСпециализаций = Параметры.Врач.Специализации.Выгрузить(,"Специализация");
	
	Если Параметры.Врач.Метаданные().ТабличныеЧасти.Найти("СпециализацииФРМР") <> Неопределено Тогда
		ТабСпециализацийФРМР = Параметры.Врач["СпециализацииФРМР"].Выгрузить(,"Специализация");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТабСпециализаций, ТабСпециализацийФРМР);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КатегорииВыработки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КатегорииВыработки КАК КатегорииВыработки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КатегорииВыработки.Наименование";
	Запрос = Новый Запрос(ТекстЗапроса);
	Специализации = Запрос.Выполнить().Выгрузить();
	
	// Находим шаблоны основной специализации врача
	Если ЗначениеЗаполнено(Параметры.Врач.Специализация) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.СпециализацииШаблоновОсмотра КАК СпециализацииШаблоновОсмотра
		               |ГДЕ
		               |	СпециализацииШаблоновОсмотра.Специализация = &Специализация
		               |	И НЕ СпециализацииШаблоновОсмотра.ШаблонОсмотра.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	СпециализацииШаблоновОсмотра.Основной УБЫВ,
		               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра.Наименование";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Специализация",Параметры.Врач.Специализация);
		ШаблоныОсновнойСпец = Запрос.Выполнить().Выгрузить();
		Если ШаблоныОсновнойСпец.Количество() <> 0 Тогда
			Группа = СоздатьГруппуСпециализации(Параметры.Врач.Специализация, Ложь);
			РазместитьШаблоныВГруппе(ШаблоныОсновнойСпец,Группа);
		КонецЕсли;
	КонецЕсли;

	// Находим шаблоны не основной специализаций врача
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СпециализацииШаблоновОсмотра.Специализация КАК Специализация,
	               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.СпециализацииШаблоновОсмотра КАК СпециализацииШаблоновОсмотра
	               |ГДЕ
	               |	СпециализацииШаблоновОсмотра.Специализация В(&ТабСпециализаций)
	               |	И СпециализацииШаблоновОсмотра.Специализация <> &Основная
	               |	И НЕ СпециализацииШаблоновОсмотра.ШаблонОсмотра.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СпециализацииШаблоновОсмотра.Специализация,
	               |	СпециализацииШаблоновОсмотра.Основной УБЫВ,
	               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра.Наименование";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТабСпециализаций",ТабСпециализаций);
	Запрос.УстановитьПараметр("Основная",Параметры.Врач.Специализация);
	ШаблоныСоСпециализациями = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Специализация Из Специализации Цикл
		Отбор = Новый Структура("Специализация",Специализация.Ссылка);
		ШаблоныСпециализации = ШаблоныСоСпециализациями.НайтиСтроки(Отбор);	
		Если ШаблоныСпециализации.Количество() <> 0 Тогда
			Группа = СоздатьГруппуСпециализации(Специализация.Ссылка, Ложь);
			
			РазместитьШаблоныВГруппе(ШаблоныСпециализации,Группа);	
		КонецЕсли; 	
	КонецЦикла; 
	
	//// Шаблоны других специализаций (которых нет у текущего врача)
	//ТекстЗапроса = "ВЫБРАТЬ
	//               |	СпециализацииШаблоновОсмотра.Специализация КАК Специализация,
	//               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра КАК Ссылка
	//               |ИЗ
	//               |	РегистрСведений.СпециализацииШаблоновОсмотра КАК СпециализацииШаблоновОсмотра
	//               |ГДЕ
	//               |	НЕ СпециализацииШаблоновОсмотра.Специализация В (&ТабСпециализаций)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Специализация,
	//               |	Ссылка";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("ТабСпециализаций",ТабСпециализаций);
	//ШаблоныСоСпециализациями = Запрос.Выполнить().Выгрузить();	
	//Для каждого Специализация Из Специализации Цикл
	//	Отбор = Новый Структура("Специализация",Специализация.Ссылка);
	//	ШаблоныСпециализации = ШаблоныСоСпециализациями.НайтиСтроки(Отбор);	
	//	Если ШаблоныСпециализации.Количество() <> 0 Тогда
	//		Группа = СоздатьГруппуСпециализации(Специализация.Ссылка);
	//		РазместитьШаблоныВГруппе(ШаблоныСпециализации,Группа);	
	//	КонецЕсли; 	
	//КонецЦикла; 

	//// Шаблоны без специализации
	//ТекстЗапроса = "ВЫБРАТЬ
	//               |	СпециализацииШаблоновОсмотра.ШаблонОсмотра КАК Ссылка
	//               |ПОМЕСТИТЬ ШаблоныСоСпец
	//               |ИЗ
	//               |	РегистрСведений.СпециализацииШаблоновОсмотра КАК СпециализацииШаблоновОсмотра
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ШаблоныHTML.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.ШаблоныHTML КАК ШаблоныHTML
	//               |ГДЕ
	//               |	Не ШаблоныHTML.Ссылка В(Выбрать Ссылка Из ШаблоныСоСпец)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ШаблоныHTML.Наименование";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//ШаблоныБезСпециализации = Запрос.Выполнить().Выгрузить();
	//Группа = СоздатьГруппуСпециализации("Шаблоны без специализации");
	//РазместитьШаблоныВГруппе(ШаблоныБезСпециализации,Группа);

КонецПроцедуры

&НаСервере
Функция СоздатьГруппуСпециализации(Специализация, Скрывать = Истина)
	
	Если ТипЗнч(Специализация) = Тип("Строка") Тогда
		Имя = "ШаблоныБезСпециализации";
	Иначе
		Имя = ИмяГруппыПоСпециализации(Специализация);
	КонецЕсли;
	
	Группа = Элементы.Добавить(Имя,Тип("ГруппаФормы"),Элементы.СтраницаКнопок);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	Группа.Заголовок = Специализация;
	Группа.ШрифтЗаголовка = ШрифтыСтиля.ОченьКрупныйШрифтТекста;
	Группа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	Группа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.РастягиватьПоВертикали = Ложь;
	Если Скрывать Тогда
		Группа.Скрыть();	
	КонецЕсли; 
	Возврат Группа;
КонецФункции

&НаСервере
Процедура РазместитьШаблоныВГруппе(СписокШаблонов, ГруппаСпециализации)
	
	КоличествоШаблонов = СписокШаблонов.Количество();
	Если КоличествоШаблонов = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	МаксКоличествоВСтроке = Цел(КоличествоШаблонов/Sqrt(КоличествоШаблонов));
	Если МаксКоличествоВСтроке < 4 Тогда
		МаксКоличествоВСтроке = 4;	
	ИначеЕсли МаксКоличествоВСтроке > 5 Тогда
		МаксКоличествоВСтроке = 5;	
	КонецЕсли;
	
	СчШаблоновВСтроке = 0;	
	СчСтроки = 1;
	СчКнопки = 1;
	Если Не ЗначениеЗаполнено(НомерКоманды) Тогда
		НомерКоманды = 1;	
	КонецЕсли;
	
	Для Каждого Шаблон Из СписокШаблонов Цикл
		Если СчШаблоновВСтроке = 0 Тогда
			ГруппаСтроки = Элементы.Добавить(ГруппаСпециализации.Имя + СчСтроки,Тип("ГруппаФормы"),ГруппаСпециализации);
			ГруппаСтроки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтроки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			СчСтроки = СчСтроки + 1;
		КонецЕсли; 
		
		// Создание кнопки
		ИмяКнопки = ГруппаСпециализации.Имя + "Кнопка" + СчКнопки;
		Кнопка = Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"),ГруппаСтроки);
		Кнопка.Заголовок = Шаблон.Ссылка;
		Кнопка.Фигура = ФигураКнопки.Овал;
		Кнопка.Высота = 3;
		Кнопка.ВысотаЗаголовка = 2;
		Кнопка.АвтоМаксимальнаяШирина = Ложь; 
		Кнопка.МаксимальнаяШирина = 40;
		Кнопка.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста; 
		Кнопка.ИмяКоманды = "ОбновитьСписок";
		СчКнопки = СчКнопки + 1;
		
		// Заносим в таблицу ассоциаций шаблон-кнопка
		СтрокаАссоциации = АссоциацииШаблонКнопка.Добавить();
		СтрокаАссоциации.Шаблон = Шаблон.Ссылка;
		СтрокаАссоциации.Кнопка = Кнопка.Имя;
		
		СчШаблоновВСтроке = СчШаблоновВСтроке + 1;
		Если СчШаблоновВСтроке = МаксКоличествоВСтроке Тогда
			СчШаблоновВСтроке = 0;	
		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры

&НаСервереБезКонтекста
функция ИмяГруппыПоСпециализации(Специализация)
	
	Возврат "Группа" + СтрЗаменить(Строка(Специализация.УникальныйИдентификатор()), "-", "_");
	
КонецФункции

#КонецОбласти 

#Область ИзменениеСпискаШаблоныПриема

&НаКлиенте
Процедура ДобавитьШаблонВСписок(Шаблон)
	Строка = ШаблоныПриема.Добавить();	
	Строка.ШаблонПриема = Шаблон;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШаблонИзСписка(Шаблон)
	Отбор = Новый Структура("ШаблонПриема",Шаблон);
	ШаблоныПриема.Удалить(ШаблоныПриема.НайтиСтроки(Отбор)[0]);	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОбновитьКнопки(Шаблон)
	Отбор = Новый Структура("ШаблонПриема",Шаблон);		
	КоличествоШаблонов = ШаблоныПриема.НайтиСтроки(Отбор).Количество();
	ЗаголовокКнопки = Шаблон;
	Если КоличествоШаблонов > 1 Тогда
		ЗаголовокКнопки = "(" + Формат(КоличествоШаблонов,"ЧЦ=2; ЧВН=") + ") " + ЗаголовокКнопки; 	
	КонецЕсли;
	
	МассивКнопок = НайтиКнопки(Шаблон);
	Для каждого Кнопка Из МассивКнопок Цикл
		Если КоличествоШаблонов >= 1 Тогда
			Кнопка.Пометка = Истина;
			Кнопка.ЦветФона = ЦветВыделеннойКнопки;	
		Иначе
			Кнопка.Пометка = Ложь;
			Кнопка.ЦветФона = ЦветКнопки;		
		КонецЕсли;	
		Кнопка.Заголовок = ЗаголовокКнопки; 
	КонецЦикла;
	
КонецПроцедуры 
 
&НаКлиенте
Процедура ОбновитьСписок()
	Отбор = Новый Структура("Кнопка",ТекущийЭлемент.Имя);	
	Шаблон = АссоциацииШаблонКнопка.НайтиСтроки(Отбор)[0].Шаблон;	

	Если РежимТрактовкиНажатия = 1 Тогда
		// Плюс 1.
		ДобавитьШаблонВСписок(Шаблон);		
	Иначе
		Если ТекущийЭлемент.Пометка Тогда
			УдалитьШаблонИзСписка(Шаблон);
		Иначе
			ДобавитьШаблонВСписок(Шаблон);
			Если РежимТрактовкиНажатия = 0 Тогда
				// Выбрать и закрыть
				Применить(Неопределено);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	ОбновитьКнопки(Шаблон);
	ТекущийЭлемент.Пометка = ТекущийЭлемент.Пометка;
КонецПроцедуры 

&НаКлиенте
Функция НайтиКнопки(Шаблон)
	Отбор = Новый Структура("Шаблон",Шаблон);
	МассивКнопок = Новый Массив();
	Для каждого Строка Из АссоциацииШаблонКнопка.НайтиСтроки(Отбор) Цикл
		Кнопка = Элементы.Найти(Строка.Кнопка);	
		МассивКнопок.Добавить(Кнопка);
	КонецЦикла; 
	Возврат МассивКнопок;
КонецФункции

#КонецОбласти
